PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
	//BSP_LCD_DisplayStringAt(250, LINE(20), (uint8_t *)"  [PLAY ]", LEFT_MODE);
	///AudioState = AUDIO_STATE_PLAY;

	//HAL_Delay(1000);

    /*----------------------RECORDER-------------------------------------------------------*/	
    /* Initial for microphone's data reading */
    //BSP_AUDIO_IN_Init(INPUT_DEVICE_DIGITAL_MICROPHONE_2, uwVolume, DEFAULT_AUDIO_IN_FREQ); 

    /* Record process*/
    //BSP_AUDIO_IN_Record((uint16_t*)&Buffer1.pcm_buff[0], AUDIO_OUT_BUFFER_SIZE); //8192	

	//BufferCtlRecIn.wr_state = BUFFER_EMPTY;
        
	/*-----------------------------------------------------------------------------------*/







	/*----------------------------------STATE MACHINE CONTROL----------------------------*/
	/* Streaming state */
    AudioDemo.state =  AUDI0_DEMO_STREAMING;
	appli_state = APPLICATION_READY;


	/*------------------------------------------------------------------------------------*/

	
}

void Audio_Streaming(void)
{


	/*------------------------------------------------------------------------------------------*/

	/*-----------------------------PLAY FROM SAI------------------------------------------------*/

	if(BufferCtlPlayOut.state == BUFFER_OFFSET_HALF)
    {

		 BufferCtlPlayOut.state = BUFFER_OFFSET_NONE;

		 //BSP_LCD_DisplayStringAtLine(18,(uint8_t *)BufferCtlPlayOut.buff);
		 if (cntTransFinish==0)
		 {
		     I2S_Init();
			 cntTransFinish = 1;
		 }
	
	}

	if(BufferCtlPlayOut.state == BUFFER_OFFSET_FULL)
    {
         /* copy from Buffer1 to BufferCtlPlayOut */
         //memcpy(&BufferCtlPlayOut.buff[0],&Buffer1.pcm_buff[0],2*AUDIO_OUT_BUFFER_SIZE);
		 BufferCtlPlayOut.state = BUFFER_OFFSET_NONE;



         		/*Adjust the Audio frequency */
         //PlayerIni(DEFAULT_AUDIO_IN_FREQ);//WaveFormat.SampleRate
				 /* Record process*/
         //BSP_AUDIO_IN_Record((uint16_t*)&BufferCtlRecIn.pcm_buff[0], AUDIO_OUT_BUFFER_SIZE);    
		 //BSP_LCD_DisplayStringAtLine(19,(uint8_t *)BufferCtlPlayOut.buff);
	
	}

	/* -------------------------------------------------------------------------------------------*/
	
	
}


void SPI1_Ini(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

 
   	 
  /* Enable SCK, MOSI and MISO GPIO clocks */
  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull  = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;

  /* SPI SCK pin configuration */
  GPIO_InitStructure.Alternate = SPI1_SCK_AF;
  GPIO_InitStructure.Pin = SPI1_SCK_PIN;
  HAL_GPIO_Init(SPI1_SCK_GPIO_PORT,&GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MOSI_SOURCE;
  GPIO_InitStructure.Pin =  SPI1_MOSI_PIN;
  HAL_GPIO_Init(SPI1_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* SPI MISO pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MISO_SOURCE;
  GPIO_InitStructure.Pin = SPI1_MISO_PIN;
  HAL_GPIO_Init(SPI1_MISO_GPIO_PORT, &GPIO_InitStructure);

  /* SPI configuration -------------------------------------------------------*/
  //SPI_I2S_DeInit(SPI1);
  
  spi1_ins.Init.Direction = SPI_DIRECTION_2LINES_RXONLY;
  spi1_ins.Init.DataSize = SPI_DATASIZE_16BIT;
  spi1_ins.Init.CLKPolarity = SPI_POLARITY_LOW;
  spi1_ins.Init.CLKPhase = SPI_PHASE_1EDGE;
  spi1_ins.Init.NSS = SPI_NSS_SOFT;
  spi1_ins.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
  spi1_ins.Init.FirstBit = SPI_FIRSTBIT_MSB;
  spi1_ins.Init.CRCPolynomial = 7;
  spi1_ins.Init.Mode = SPI_MODE_SLAVE;
  if(HAL_SPI_Init(&spi1_ins) != HAL_OK)
  {
    /* Initialization Error */
    //Error_Handler();
  }
  
 
  GPIO_InitStructure.Pin = GPIO_PIN_3;
  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
  GPIO_InitStructure.Pull = GPIO_PULLUP;
  //GPIO_InitStructure.Alternate 
  HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);

  /* Deselect : Chip Select high */
  HAL_GPIO_WritePin(GPIOE,GPIO_PIN_3,GPIO_PIN_SET);
   /* sop1hc */
  /* Configure the SPI interrupt priority */
  HAL_NVIC_SetPriority(SPI1_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(SPI1_IRQn);
  //SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);
  //__HAL_SPI_ENABLE_IT(SPI1,SPI_IT_TXE);

  /* Enable SPI1  */
  //__HAL_SPI_ENABLE(SPI1);

}

void mySPI_SendData(uint8_t adress, uint8_t data)
{
 
while(!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_TXE)); 
SPI_I2S_SendData(SPI1, adress);

while(!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_RXNE));
SPI_I2S_ReceiveData(SPI1);

while(!!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_TXE)); 
SPI_I2S_SendData(SPI1, data);

while(!!__HAL_SPI_GET_FLAG(&spi1_ins, SPI_FLAG_RXNE));
SPI_I2S_ReceiveData(SPI1);
 
}

/**
  * @brief  This function handles AUDIO_REC_SPI global interrupt request.
  * @param  None
  * @retval None
*/

void SPI1_IRQHandler(void)
{  
   //uint16_t volume;
   uint16_t app;
   

  /* Check if data are available in SPI Data register */
  if (__HAL_SPI_GET_FLAG(&spi1_ins, SPI_IT_TXE) != RESET)
  {
	
    app = SPI_I2S_ReceiveData(SPI1);
	
    SPI_I2S_SendData(SPI1, 3333);
   }
}


/**
  * @brief  This function handles AUDIO_REC_SPI global interrupt request.
  * @param  None
  * @retval None
*/

void SPI2_IRQHandler(void)
{  
    uint16_t volume;
    uint16_t app;
  

  /* Check if data are available in SPI Data register */
   if ((__HAL_SPI_GET_FLAG(&hi2s2, SPI_FLAG_RXNE) != RESET)
   	//    &&(__HAL_SPI_GET_IT_SOURCE(&hi2s2, SPI_IT_RXNE)!=RESET)
   	  )
   {
    
     app = SPI_I2S_ReceiveData(SPI2);   
     //SPI_I2S_SendData(SPI2, 3333);
     /*
	 pDataI2S2[iBuff++] =  HTONS(app);

	 volume = 64;
	 
	 if (iBuff>=64)
     {
        PDM_Filter_64_LSB((uint8_t *)pDataI2S2,
		(uint16_t *)(Buffer1.pcm_buff + Buffer1.offset + cntPos*16), volume , (PDMFilter_InitStruct *)&Filter[0]);
		iBuff=0;
		cntPos++;
		if (cntPos>=256) cntPos=0;
     }
     */
     
	 //BSP_LED_Toggle(LED1);
 	 //if (Buffer1.offset + idxSPI5DataBuf1 < AUDIO_OUT_BUFFER_SIZE-1)	  
     //    Buffer1.pcm_buff[Buffer1.offset + idxSPI5DataBuf1++] = app;//HTONS(test);

   	}
    //HAL_I2S_IRQHandler(&hi2s2);
   

